app/controllers/page_controller.rb

	def newsletter_submit
		@newsletter=Newsletter.new(newsletter_params)
		if @newsletter.save
---
INSERT INTO `newsletters` (`email`, `created_at`, `updated_at`) VALUES ('aman_kumar@esferasoft.com', '2015-10-27 05:49:57', '2015-10-27 05:49:57')