app/views/layouts/_currency.html.erb

<% @arrCurrency = Currency.all %>
---
SELECT `currencies`.* FROM `currencies`